#создаю полноценную игру "камень/ножницы/бумага"

import random
import time

cuefa = ['камень', 'ножницы', 'бумага']

print('Давай поиграем в игру "камень, ножницы, бумага"')

# создаю функцию полной проверки ответов в игре
def play():
    if (user == 'бумага' and bot == 'камень'):
        print('\nМолодец, ты выиграл!')
    elif (user == 'ножницы' and bot == 'бумага'):
        print('\nМолодец, ты выиграл!')
    elif (user == 'камень' and bot == 'ножницы'):
        print('\nМолодец, ты выиграл!')
    elif (user == 'камень' and bot == 'бумага'):
        print('\nЯ выиграл! Может в следующий раз повезет.')
    elif (user == 'бумага' and bot == 'ножницы'):
        print('\nЯ выиграл! Может в следующий раз повезет.')
    elif (user == 'ножницы' and bot == 'камень'):
        print('\nЯ выиграл! Может в следующий раз повезет.')
    else:
        print('Видимо что то пошло не так :(')

# задаю переменную с рандомным ответов и приписываю свою функцию
while True:
    bot = random.choice(cuefa)
    user = input('Введи свой выбор: ').lower()
    print('раз...')
    time.sleep(1)
    print('два...')
    time.sleep(1)
    print('три!')
    time.sleep(1)
    print(f'Твой выбор: {user}')
    print(f'Мой выбор: {bot}')
    play()  # моя функция
    
    # тут проверка хочет пользователь еще играть или нет
    repeat = input('Продолжим? ').lower()
    if repeat == 'да':
        continue
    else:
        break
    
    